
       01  AUTHORS-TABLE.
           03 AU-ID           PIC X(4).
           03 AU-LNAME        PIC X(40).
           03 AU-FNAME        PIC X(20).
           03 PHONE           PIC X(12).
           03 ADDRESS         PIC X(40).
           03 CITY            PIC X(20).
           03 STATE           PIC X(2).
           03 COUNTRY         PIC X(12).
           03 POSTALCODE      PIC X(10).
      


      * Copyright (C) 1996-1999 MERANT International Ltd.
      * All rights reserved.
