*  Copyright (C) 1991-1999 MERANT International Ltd.
*  All rights reserved.
*
* PCB FOR IMS PRINTER LTERMS
         PCB   TYPE=TP,MODIFY=YES
*
* PRIMARY ACCESS TO TESTING SERVICES DATA BASE
         PCB   TYPE=DB,DBDNAME=CASTPUBS,PROCOPT=AP,KEYLEN=9,POS=M
         SENSEG NAME=AUTHORS,PARENT=0
         SENSEG NAME=TITLES,PARENT=AUTHORS
         SENSEG NAME=MYRF,PARENT=AUTHORS
*
         PSBGEN LANG=COB,PSBNAME=TEST1,CMPAT=YES
         END
